{
    "navbar": {
        "myWorks": "Çalışmalarım",
        "about": "Hakkımda",
        "contact": "İletişim"
    },
    "aboutMe": {
        "title": "Hakkımda",
        "description":
            "Mobil geliştirme ve web alanında yaptığım çalışmalarla kullanıcıların deneyimlerini kolaylaştıracak yenilikçi ürünler oluşturuyorum. Dart/Flutter ile mobil uygulamalar geliştiriyorum ve React.js ile web siteleri yazıyorum. Veritabanı olarak MongoDB ve SQLite ile çalışıyor, Node.js/Express.js ile backend geliştiriyorum."
    },
    "myWorks": {
        "title": "Çalışmalarım",
        "description":
            "Daha önce çalıştığım projeleri ve geliştirmekte olduğum yeni projeleri buradan inceleyebilirsiniz. Her biri özenle hazırlanmış, müşteri odaklı ve görsel olarak çekici projelerdir."
    },
    "home": {
        "title": "Merhaba, Ben Hikmet Melik FIRAT",
        "paragraph":
            "Mobil ve web geliştirme alanında uzmanlaşmış tutkulu bir Yazılım Mühendisi olarak, işlevselliği ve kullanıcı deneyimini sorunsuz bir şekilde entegre eden yenilikçi dijital çözümler oluşturmaya çalışıyorum. Odak noktam, hem iş gereksinimlerini hem de son kullanıcı beklentilerini karşılayan ölçeklenebilir uygulamalar tasarlamak ve geliştirmektir."
    },
    "mySkills": {
        "title": "Yeteneklerim"
    },
    "contactMe": {
        "title": "İletişim",
        "description":
            "Birlikte çalışmak mı istiyorsunuz veya bir sorunuz mu var? Bana ulaşmaktan çekinmeyin. Fikirlerinizi harika dijital gerçekliklere dönüştürmenize yardımcı olmak için buradayım. Yakında sizden haber almayı dört gözle bekliyorum!"
    },
    "projects": [
        {
        "id": 1,
        "name": "Müşteri Uygulaması",
        "description": "Argekip Bilisim Teknolojileri Stajı için Müşteri Uygulaması projesi. Kullanıcılar, herhangi bir durum yönetimi yöntemi olmadan müşteriler üzerinde CRUD işlemleri yapabilirler. Uygulama, Müşteri Backend adlı backend hizmetimle iletişim kurar. Kullanılan teknolojiler: Dart/Flutter.",
        "github": "https://github.com/HikmetMelikk/CustomerApp",
        "image": "/assets/customerapp_ss.png"},
        {
        "id": 2,
        "name": "Müşteri Backend",
        "description": "Argekip Bilisim Teknolojileri Stajı için Müşteri Backend projesi. Müşteri Uygulaması için backend hizmeti. Basit işlemler için kullanıma uygundur. Kullanılan teknolojiler: Node.js, Express.js, MongoDB.",
        "github": "https://github.com/HikmetMelikk/Customer-Backend"
        },
        {
        "id": 3,
        "name": "Ballsquad Teknik Test Çözümü",
        "description": "Ballsquad Erasmus+ Stajı için Ballsquad Teknik Test Çözümü projesi. Flutter ile Bloc/Cubit ve Dio paketlerini kullanmama izin veren ve 'https://openlibrary.org' adresine istek göndererek yazarları ekranda gösteren ve ardından ilgili yazar tıklandığında yazarın ayrıntılarını gösteren bir proje yazdım. Kullanılan teknolojiler ve paketler: Dart/Flutter, Bloc/Cubit, Dio.",
        "github": "https://github.com/HikmetMelikk/ballsquad-project",
        "image": "/assets/ballsquad_ss.png"
        },
        { 
        "id": 4,
        "name":"Voyagist Uygulaması",
        "description": "Ondokuz Mayıs Üniversitesi Bilgisayar Mühendisliği mezuniyet projesi. Bu projenin amacı, kullanıcıların bir şehirdeki tarihi yerleri tek tek araştırmasının önüne geçmektir. Uygulama, kullanıcının bulunduğu şehirdeki tarihi yerlerle bir rota çizer ve kullanıcılara zaman kazandırır. Kullanılan teknolojiler: Dart/Flutter, Node.js/Express.js, MongoDB, Firebase, Sengrid Email API.",
        "image": "/assets/voyagist_ss.png"
        }
    ]
}